"use client";

export default function TermsOfService() {
    return (
        <div className="w-[70vw]">
            <h1 className="text-4xl text-[#5c9ae0]">ข้อกำหนดในการให้บริการ</h1>
            <h3 className="text-3xl">ข้อตกลงนี้ระบุถึงบอทดิสคอร์ด "HStudio" หรือกล่าวได้ว่า "บอทที่อยู่ในเครือ HewkawDiscordBotProject" หากผู้ใดใช้งานบอทในเครือ "HewkawDiscordBotProject" ถือว่ารับข้อตกลงดังต่อไปนี้</h3>
            <ul className="list-disc ml-8">
                <li>บอทในเครือ "HStudio" ไม่รับประกันออนไลน์ 99.99</li>
                <li>บอทในเครือ "HStudio" จะปิดให้บริการเมื่อไหร่ก็ได้โดยไม่ต้องแจ้งให้ทราบ</li>
                <li>บอทในเครือ "HStudio" จะปิดเพื่อปรับปรุงเมื่อไหร่ก็ได้</li>
                <li>ทาง "HStudio" ไม่สามารถและมิอาจรับประกันความปลอดภัยของดิสที่ใช้งานบอท ผู้ใช้งานควรศึกษาและมีความรู้ก่อนตัดสินใจใช้งานบอท</li>
                <li>ทาง "HStudio" มีสิทธิ์ที่จะปฏิเสธในการให้ใช้งานบอท HStudio โดยที่ไม่ต้องระบุเหตุผล</li>
                <li>ข้อตกลงที่กล่าวมานั้น สามารถเปลี่ยนแปลงได้ตลอดโดยไม่ต้องแจ้งให้ทราบล่วงหน้า</li>
            </ul>
        </div>
    )
}